GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F13114.inc
        LIST
;==========================================================================
;
;  Built by Great Cow BASIC convertor
;  MPASM processor include for the chip shown below
;
; C:\Users\admin\.mchp_packs\index.idx
; C:\Users\admin\.mchp_packs\Microchip\PIC16F1xxxx_DFP\1.25.389\xc8\pic\dat\ini\16F13114.ini
; C:\Users\admin\.mchp_packs\Microchip\PIC16F1xxxx_DFP\1.25.389\edc\PIC16F13114.PIC
; C:\Users\admin\.mchp_packs\Microchip\PIC16F1xxxx_DFP\1.25.389\xc8\pic\dat\cfgdata\16F13114.cfgdata
;
;==========================================================================
        NOLIST
        IFNDEF __16F13114
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF
;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------

;-----Bank0------------------
INDF0            EQU  H'0000'
INDF1            EQU  H'0001'
PCL              EQU  H'0002'
STATUS           EQU  H'0003'
FSR0             EQU  H'0004'
FSR0L            EQU  H'0004'
FSR0H            EQU  H'0005'
FSR1             EQU  H'0006'
FSR1L            EQU  H'0006'
FSR1H            EQU  H'0007'
BSR              EQU  H'0008'
WREG             EQU  H'0009'
PCLATH           EQU  H'000A'
INTCON           EQU  H'000B'
PORTA            EQU  H'000C'
TRISA            EQU  H'0012'
LATA             EQU  H'0018'

;-----Bank1------------------
PIR0             EQU  H'008C'
PIR1             EQU  H'008D'
PIR2             EQU  H'008E'
PIR3             EQU  H'008F'
PIR4             EQU  H'0090'
PIR5             EQU  H'0091'
PIR6             EQU  H'0092'
PIR7             EQU  H'0093'
PIE0             EQU  H'0096'
PIE1             EQU  H'0097'
PIE2             EQU  H'0098'
PIE3             EQU  H'0099'
PIE4             EQU  H'009A'
PIE5             EQU  H'009B'
PIE6             EQU  H'009C'
PIE7             EQU  H'009D'

;-----Bank2------------------
PMD0             EQU  H'010C'
PMD1             EQU  H'010D'
PMD2             EQU  H'010E'
PMD3             EQU  H'010F'
PMD4             EQU  H'0110'
PMD5             EQU  H'0111'

;-----Bank3------------------
WDTCON0          EQU  H'018C'
WDTCON1          EQU  H'018D'
WDTPS            EQU  H'018E'
WDTPSL           EQU  H'018E'
WDTPSH           EQU  H'018F'
WDTTMR           EQU  H'0190'
BORCON           EQU  H'0191'
PCON0            EQU  H'0192'
PCON1            EQU  H'0193'
TMR0L            EQU  H'019C'
TMR0             EQU  H'019C'
TMR0H            EQU  H'019D'
PR0              EQU  H'019D'
T0CON0           EQU  H'019E'
T0CON1           EQU  H'019F'

;-----Bank4------------------
FVRCON           EQU  H'020C'
CPCON            EQU  H'020D'

;-----Bank5------------------
CPUDOZE          EQU  H'028C'
OSCCON1          EQU  H'028D'
OSCCON2          EQU  H'028E'
OSCCON3          EQU  H'028F'
OSCSTAT          EQU  H'0290'
OSCEN            EQU  H'0291'
OSCTUNE          EQU  H'0292'
OSCFRQ           EQU  H'0293'

;-----Bank6------------------
TMR1             EQU  H'030C'
TMR1L            EQU  H'030C'
TMR1H            EQU  H'030D'
T1CON            EQU  H'030E'
T1GCON           EQU  H'030F'
PR1              EQU  H'030F'
T1GATE           EQU  H'0310'
TMR1GATE         EQU  H'0310'
T1CLK            EQU  H'0311'
TMR1CLK          EQU  H'0311'

;-----Bank7------------------
T2TMR            EQU  H'038C'
TMR2             EQU  H'038C'
T2PR             EQU  H'038D'
PR2              EQU  H'038D'
T2CON            EQU  H'038E'
T2HLT            EQU  H'038F'
T2CLKCON         EQU  H'0390'
T2CLK            EQU  H'0390'
T2RST            EQU  H'0391'

;-----Bank8------------------
CCPR1            EQU  H'040C'
CCPR1L           EQU  H'040C'
CCPR1H           EQU  H'040D'
CCP1CON          EQU  H'040E'
CCP1CAP          EQU  H'040F'
CCPR2            EQU  H'0410'
CCPR2L           EQU  H'0410'
CCPR2H           EQU  H'0411'
CCP2CON          EQU  H'0412'
CCP2CAP          EQU  H'0413'
CCPTMRS0         EQU  H'041F'

;-----Bank10------------------
CLBCON           EQU  H'050C'
CLBSWINU         EQU  H'050D'
CLBSWINH         EQU  H'050E'
CLBSWINM         EQU  H'050F'
CLBSWINL         EQU  H'0510'
CLBCLK           EQU  H'0515'
CLBPPSCON4       EQU  H'0516'
CLBPPSCON3       EQU  H'0517'
CLBPPSCON2       EQU  H'0518'
CLBPPSCON1       EQU  H'0519'

;-----Bank13------------------
CLCNCON          EQU  H'068C'
CLCNPOL          EQU  H'068D'
CLCNSEL0         EQU  H'068E'
CLCNSEL1         EQU  H'068F'
CLCNSEL2         EQU  H'0690'
CLCNSEL3         EQU  H'0691'
CLCNGLS0         EQU  H'0692'
CLCNGLS1         EQU  H'0693'
CLCNGLS2         EQU  H'0694'
CLCNGLS3         EQU  H'0695'
CLCSELECT        EQU  H'0696'
CLCDATA          EQU  H'0697'

;-----Bank14------------------
RC1REG           EQU  H'070C'
TX1REG           EQU  H'070D'
SP1BRG           EQU  H'070E'
SP1BRGL          EQU  H'070E'
SP1BRGH          EQU  H'070F'
RC1STA           EQU  H'0710'
TX1STA           EQU  H'0711'
BAUD1CON         EQU  H'0712'

;-----Bank15------------------
SSP1BUF          EQU  H'078C'
SSP1ADD          EQU  H'078D'
SSP1MSK          EQU  H'078E'
SSP1STAT         EQU  H'078F'
SSP1CON1         EQU  H'0790'
SSP1CON2         EQU  H'0791'
SSP1CON3         EQU  H'0792'

;-----Bank16------------------
CM1CON0          EQU  H'080C'
CM1CON1          EQU  H'080D'
CM1NCH           EQU  H'080E'
CM1PCH           EQU  H'080F'
CM2CON0          EQU  H'0810'
CM2CON1          EQU  H'0811'
CM2NCH           EQU  H'0812'
CM2PCH           EQU  H'0813'
CMOUT            EQU  H'081F'
PWM1DC           EQU  H'0820'
PWM1DCL          EQU  H'0820'
PWM1DCH          EQU  H'0821'
PWM1CON          EQU  H'0822'
PWM2DC           EQU  H'0823'
PWM2DCL          EQU  H'0823'
PWM2DCH          EQU  H'0824'
PWM2CON          EQU  H'0825'
PWMTMRS0         EQU  H'082F'

;-----Bank17------------------
DAC1CON          EQU  H'088C'
DAC1DATL         EQU  H'088D'

;-----Bank57------------------
NVMADR           EQU  H'1C8C'
NVMADRL          EQU  H'1C8C'
NVMADRH          EQU  H'1C8D'
NVMDAT           EQU  H'1C8E'
NVMDATL          EQU  H'1C8E'
NVMDATH          EQU  H'1C8F'
NVMCON1          EQU  H'1C90'
NVMCON2          EQU  H'1C91'
SCANCON0         EQU  H'1C92'
SCANLADR         EQU  H'1C93'
SCANLADRL        EQU  H'1C93'
SCANLADRH        EQU  H'1C94'
SCANHADR         EQU  H'1C96'
SCANHADRL        EQU  H'1C96'
SCANHADRH        EQU  H'1C97'
SCANDPS          EQU  H'1C99'
SCANTRIG         EQU  H'1C9A'
CRCDATA          EQU  H'1C9D'
CRCDATAL         EQU  H'1C9D'
CRCDATAH         EQU  H'1C9E'
CRCDATAU         EQU  H'1C9F'
CRCDATAT         EQU  H'1CA0'
CRCOUT           EQU  H'1CA1'
CRCSHFT          EQU  H'1CA1'
CRCXOR           EQU  H'1CA1'
CRCOUTL          EQU  H'1CA1'
CRCSHFTL         EQU  H'1CA1'
CRCSHIFTL        EQU  H'1CA1'
CRCXORL          EQU  H'1CA1'
CRCOUTH          EQU  H'1CA2'
CRCSHFTH         EQU  H'1CA2'
CRCSHIFTH        EQU  H'1CA2'
CRCXORH          EQU  H'1CA2'
CRCOUTU          EQU  H'1CA3'
CRCSHFTU         EQU  H'1CA3'
CRCSHIFTU        EQU  H'1CA3'
CRCXORU          EQU  H'1CA3'
CRCOUTT          EQU  H'1CA4'
CRCSHFTT         EQU  H'1CA4'
CRCSHIFTT        EQU  H'1CA4'
CRCXORT          EQU  H'1CA4'
CRCCON0          EQU  H'1CA5'
CRCCON1          EQU  H'1CA6'
CRCCON2          EQU  H'1CA7'

;-----Bank58------------------
ADLTH            EQU  H'1D0C'
ADLTHL           EQU  H'1D0C'
ADLTHH           EQU  H'1D0D'
ADUTH            EQU  H'1D0E'
ADUTHL           EQU  H'1D0E'
ADUTHH           EQU  H'1D0F'
ADERR            EQU  H'1D10'
ADERRL           EQU  H'1D10'
ADERRH           EQU  H'1D11'
ADSTPT           EQU  H'1D12'
ADSTPTL          EQU  H'1D12'
ADSTPTH          EQU  H'1D13'
ADFLTR           EQU  H'1D14'
ADFLTRL          EQU  H'1D14'
ADFLTRH          EQU  H'1D15'
ADACC            EQU  H'1D16'
ADACCL           EQU  H'1D16'
ADACCH           EQU  H'1D17'
ADACCU           EQU  H'1D18'
ADCNT            EQU  H'1D19'
ADRPT            EQU  H'1D1A'
ADPREV           EQU  H'1D1B'
ADPREVL          EQU  H'1D1B'
ADPREVH          EQU  H'1D1C'
ADRES            EQU  H'1D1D'
ADRESL           EQU  H'1D1D'
ADRESH           EQU  H'1D1E'
ADPCH            EQU  H'1D1F'
ADACQ            EQU  H'1D21'
ADACQL           EQU  H'1D21'
ADACQH           EQU  H'1D22'
ADCAP            EQU  H'1D23'
ADPRE            EQU  H'1D24'
ADPREL           EQU  H'1D24'
ADPREH           EQU  H'1D25'
ADCON0           EQU  H'1D26'
ADCON1           EQU  H'1D27'
ADCON2           EQU  H'1D28'
ADCON3           EQU  H'1D29'
ADSTAT           EQU  H'1D2A'
ADREF            EQU  H'1D2B'
ADACT            EQU  H'1D2C'
ADCLK            EQU  H'1D2D'
ADCG1A           EQU  H'1D2E'

;-----Bank59------------------
RA0PPS           EQU  H'1D8C'
RA1PPS           EQU  H'1D8D'
RA2PPS           EQU  H'1D8E'
RA4PPS           EQU  H'1D90'
RA5PPS           EQU  H'1D91'

;-----Bank60------------------
PPSLOCK          EQU  H'1E0C'
INTPPS           EQU  H'1E0D'
T0CKIPPS         EQU  H'1E0E'
T1CKIPPS         EQU  H'1E0F'
T1GPPS           EQU  H'1E10'
T2INPPS          EQU  H'1E19'
CCP1PPS          EQU  H'1E1E'
CCP2PPS          EQU  H'1E1F'
CLCIN0PPS        EQU  H'1E3D'
CLCIN1PPS        EQU  H'1E3E'
CLCIN2PPS        EQU  H'1E3F'
CLCIN3PPS        EQU  H'1E40'
CK1PPS           EQU  H'1E41'
RX1DTPPS         EQU  H'1E41'
RX1PPS           EQU  H'1E42'
TX1CKPPS         EQU  H'1E42'

;-----Bank61------------------
SSP1CLKPPS       EQU  H'1E47'
SSP1DATPPS       EQU  H'1E48'
SSP1SSPPS        EQU  H'1E49'
ADACTPPS         EQU  H'1E50'
CLBIN0PPS        EQU  H'1E57'
CLBIN1PPS        EQU  H'1E58'
CLBIN2PPS        EQU  H'1E59'
CLBIN3PPS        EQU  H'1E5A'
ANSELA           EQU  H'1E8C'
WPUA             EQU  H'1E8D'
ODCONA           EQU  H'1E8E'
SLRCONA          EQU  H'1E8F'
INLVLA           EQU  H'1E90'
IOCAP            EQU  H'1E91'
IOCAN            EQU  H'1E92'
IOCAF            EQU  H'1E93'

