GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F13114.inc
;-----Bank62------------------
RA1I2C           EQU  H'1EE1'
RA2I2C           EQU  H'1EE2'
UMTOAP           EQU  H'1F0C'
UMTOAL           EQU  H'1F0D'
UMTOAH           EQU  H'1F0E'

;-----Bank64------------------
STATUS_SHAD      EQU  H'1FE4'
WREG_SHAD        EQU  H'1FE5'
BSR_SHAD         EQU  H'1FE6'
PCLATH_SHAD      EQU  H'1FE7'
FSR0_SHAD        EQU  H'1FE8'
FSR0L_SHAD       EQU  H'1FE8'
FSR0H_SHAD       EQU  H'1FE9'
FSR1_SHAD        EQU  H'1FEA'
FSR1L_SHAD       EQU  H'1FEA'
FSR1H_SHAD       EQU  H'1FEB'
STKPTR           EQU  H'1FED'
TOSL             EQU  H'1FEE'
TOSH             EQU  H'1FEF'


;----- STATUS Bits -----------------------------------------------------
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
NPD              EQU  H'0003'
NTO              EQU  H'0004'
CARRY            EQU  H'0000'
ZERO             EQU  H'0002'


;----- BSR Bits -----------------------------------------------------
BSR0             EQU  H'0000'
BSR1             EQU  H'0001'
BSR2             EQU  H'0002'
BSR3             EQU  H'0003'
BSR4             EQU  H'0004'
BSR5             EQU  H'0005'


;----- INTCON Bits -----------------------------------------------------
INTEDG           EQU  H'0000'
PEIE             EQU  H'0006'
GIE              EQU  H'0007'


;----- PORTA Bits -----------------------------------------------------
RA0              EQU  H'0000'
RA1              EQU  H'0001'
RA2              EQU  H'0002'
RA3              EQU  H'0003'
RA4              EQU  H'0004'
RA5              EQU  H'0005'


;----- TRISA Bits -----------------------------------------------------
TRISA0           EQU  H'0000'
TRISA1           EQU  H'0001'
TRISA2           EQU  H'0002'
TRISA4           EQU  H'0004'
TRISA5           EQU  H'0005'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'


;----- PIR0 Bits -----------------------------------------------------
INTF             EQU  H'0000'
IOCIF            EQU  H'0004'
TMR0IF           EQU  H'0005'


;----- PIR1 Bits -----------------------------------------------------
NVMIF            EQU  H'0000'
CRCIF            EQU  H'0001'
SCANIF           EQU  H'0002'
CSWIF            EQU  H'0004'
OSFIF            EQU  H'0005'
TMR1IF           EQU  H'0006'
TMR1GIF          EQU  H'0007'


;----- PIR2 Bits -----------------------------------------------------
TMR2IF           EQU  H'0002'
CCP1IF           EQU  H'0005'
CCP2IF           EQU  H'0006'


;----- PIR4 Bits -----------------------------------------------------
CLC1IF           EQU  H'0002'
CLC2IF           EQU  H'0003'
CLC3IF           EQU  H'0004'
CLC4IF           EQU  H'0005'
TX1IF            EQU  H'0006'
RC1IF            EQU  H'0007'


;----- PIR5 Bits -----------------------------------------------------
SSP1IF           EQU  H'0002'
BCL1IF           EQU  H'0003'
CM1IF            EQU  H'0006'
CM2IF            EQU  H'0007'


;----- PIR6 Bits -----------------------------------------------------
ADIF             EQU  H'0000'
ADTIF            EQU  H'0001'


;----- PIR7 Bits -----------------------------------------------------
CLB1IF0          EQU  H'0000'
CLB1IF1          EQU  H'0001'
CLB1IF2          EQU  H'0002'
CLB1IF3          EQU  H'0003'


;----- PIE0 Bits -----------------------------------------------------
INTE             EQU  H'0000'
IOCIE            EQU  H'0004'
TMR0IE           EQU  H'0005'


;----- PIE1 Bits -----------------------------------------------------
NVMIE            EQU  H'0000'
CRCIE            EQU  H'0001'
SCANIE           EQU  H'0002'
CSWIE            EQU  H'0004'
OSFIE            EQU  H'0005'
TMR1IE           EQU  H'0006'
TMR1GIE          EQU  H'0007'


;----- PIE2 Bits -----------------------------------------------------
TMR2IE           EQU  H'0002'
CCP1IE           EQU  H'0005'
CCP2IE           EQU  H'0006'


;----- PIE4 Bits -----------------------------------------------------
CLC1IE           EQU  H'0002'
CLC2IE           EQU  H'0003'
CLC3IE           EQU  H'0004'
CLC4IE           EQU  H'0005'
TX1IE            EQU  H'0006'
RC1IE            EQU  H'0007'


;----- PIE5 Bits -----------------------------------------------------
SSP1IE           EQU  H'0002'
BCL1IE           EQU  H'0003'
CM1IE            EQU  H'0006'
CM2IE            EQU  H'0007'


;----- PIE6 Bits -----------------------------------------------------
ADIE             EQU  H'0000'
ADTIE            EQU  H'0001'


;----- PIE7 Bits -----------------------------------------------------
CLB1IE0          EQU  H'0000'
CLB1IE1          EQU  H'0001'
CLB1IE2          EQU  H'0002'
CLB1IE3          EQU  H'0003'


;----- PMD0 Bits -----------------------------------------------------
NVMMD            EQU  H'0000'
CRCMD            EQU  H'0001'
SCANMD           EQU  H'0002'
SYSCMD           EQU  H'0003'
IOCMD            EQU  H'0005'
TMR0MD           EQU  H'0007'


;----- PMD1 Bits -----------------------------------------------------
TMR1MD           EQU  H'0000'
TMR2MD           EQU  H'0002'
CCP1MD           EQU  H'0005'
CCP2MD           EQU  H'0006'


;----- PMD2 Bits -----------------------------------------------------
CLC1MD           EQU  H'0005'
CLC2MD           EQU  H'0006'
CLC3MD           EQU  H'0007'


;----- PMD3 Bits -----------------------------------------------------
CLC4MD           EQU  H'0000'
UART1MD          EQU  H'0001'
MSSP1MD          EQU  H'0003'
FVRMD            EQU  H'0005'
CM1MD            EQU  H'0006'
CM2MD            EQU  H'0007'


;----- PMD4 Bits -----------------------------------------------------
ADCMD            EQU  H'0000'
DAC1MD           EQU  H'0001'
CLBMD            EQU  H'0007'


;----- PMD5 Bits -----------------------------------------------------
PWM1MD           EQU  H'0000'
PWM2MD           EQU  H'0001'


;----- WDTCON0 Bits -----------------------------------------------------
SEN              EQU  H'0000'
SWDTEN           EQU  H'0000'
WDTSEN           EQU  H'0000'
PS0              EQU  H'0001'
PS1              EQU  H'0002'
PS2              EQU  H'0003'
PS3              EQU  H'0004'
PS4              EQU  H'0005'
WDTPS0           EQU  H'0001'
WDTPS1           EQU  H'0002'
WDTPS2           EQU  H'0003'
WDTPS3           EQU  H'0004'
WDTPS4           EQU  H'0005'


;----- WDTCON1 Bits -----------------------------------------------------
WINDOW0          EQU  H'0000'
WINDOW1          EQU  H'0001'
WINDOW2          EQU  H'0002'
CS0_WDTCON1      EQU  H'0004'
CS1_WDTCON1      EQU  H'0005'
CS2_WDTCON1      EQU  H'0006'
WDTWINDOW0       EQU  H'0000'
WDTWINDOW1       EQU  H'0001'
WDTWINDOW2       EQU  H'0002'
WDTCS0           EQU  H'0004'
WDTCS1           EQU  H'0005'
WDTCS2           EQU  H'0006'


;----- WDTPS Bits -----------------------------------------------------
PSCNT0           EQU  H'0000'
PSCNT1           EQU  H'0001'
PSCNT2           EQU  H'0002'
PSCNT3           EQU  H'0003'
PSCNT4           EQU  H'0004'
PSCNT5           EQU  H'0005'
PSCNT6           EQU  H'0006'
PSCNT7           EQU  H'0007'


;----- WDTPSH Bits -----------------------------------------------------
PSCNT8           EQU  H'0000'
PSCNT9           EQU  H'0001'
PSCNT10          EQU  H'0002'
PSCNT11          EQU  H'0003'
PSCNT12          EQU  H'0004'
PSCNT13          EQU  H'0005'
PSCNT14          EQU  H'0006'
PSCNT15          EQU  H'0007'


